insert into sales (name, expiredtime, percent) values
('акционное предложение', '2025-06-20 08:30:00.0', 30),
('специальное предложение', '2026-03-15 14:45:00.0', 25),
('летняя распродажа', '2027-04-28 10:10:00.0', 20),
('осенние скидки', '2028-08-05 17:20:00.0', 15),
('новогоднее предложение', '2029-11-12 09:55:00.0', 10),
('летние скидки', '2030-10-30 11:40:00.0', 5),
('рождественская распродажа', '2031-07-25 13:25:00.0', 18),
('черная пятница', '2032-09-02 15:15:00.0', 22),
('день рождения', '2033-04-14 12:05:00.0', 28),
('выходной раскол', '2034-03-08 16:50:00.0', 12);

insert into tours (chillplace, fromplace, date, duration, cost, tourists_number, chilltype) values
('Москва', 'Владивосток', '2031-11-25 15:20:00.0', 15, 12000, 5, 'городской'),
('Санкт-Петербург', 'Екатеринбург', '2032-12-18 08:45:00.0', 20, 15000, 2, 'городской'),
('Новосибирск', 'Красноярск', '2033-09-05 10:30:00.0', 25, 20000, 4, 'необычный'),
('Ростов-на-Дону', 'Краснодар', '2034-07-14 14:15:00.0', 30, 18000, 1, 'активный'),
('Уфа', 'Пермь', '2035-06-28 09:10:00.0', 18, 16000, 6, 'городской'),
('Казань', 'Нижний Новгород', '2036-08-20 12:00:00.0', 22, 17000, 3, 'активный'),
('Омск', 'Тюмень', '2037-05-17 16:30:00.0', 28, 22000, 5, 'активный'),
('Самара', 'Саратов', '2038-04-10 13:45:00.0', 33, 25000, 2, 'необычный'),
('Киров', 'Ижевск', '2039-02-28 17:50:00.0', 16, 14000, 4, 'городской'),
('Барнаул', 'Иркутск', '2040-11-11 10:15:00.0', 20, 19000, 1, 'необычный');

insert into accounts (login, password) values
('rootlogin', '$2a$10$FvxAHqaBz24Mhk8FccEVIOQnSgwczsDgZpZ2influ0.9jDC3/vqje'),
('login2', '$2a$10$3E82VPCm9FgH4GMX3jZdMepIgizHdJjKuOZg3gh1ngQ9Dh3IuMPuK'),
('login3', '$2a$10$0w93U37Nz2YG62vENaGyuuZd1oID1.4hOb9nD8TX77BfFeW8RZq3S'),
('login4', '$2a$10$xLrRWn8W1jG6FegBvhoZiOaXgKwMvEjx8gSZS5XDXd1K9uGr1KUWC'),
('login5', '$2a$10$jfEBpIruwSJBwH2VNE5YtOue8SvI5fazh6utwJ6XU7GxOKr8CRa7S'),
('login6', '$2a$10$jPXsoI4UZPHwL5RvpJS/OObbZ7lf5MSdyJZX4gGry/Wvux7lWmxve'),
('login7', '$2a$10$R4ZuKcw5NEdqXocw6C69Neb4h5QD5H7kEDLKg5lfdJo5HLzAxfPcG'),
('login8', '$2a$10$lyuV5ZMW.0XXQbGKzqKY1.q2WZBb4lTqLzvAMzlDkmbC9ibUuQx6m'),
('login9', '$2a$10$fg6Etd5nc7WK3/cFn.Oo7e.ZOpN4OyRKq9F1aV9mU91.VznwA0ddG'),
('login10', '$2a$10$4iOY.yIz5C1VvOZDzKDm9.GUdYUFNUEGJcDUwPqJlSGeLNY8/NG/2');

insert into clients (acc_id, name, surname, mail, phone) values
(6, 'Алексей', 'Иванов', 'alex.ivanov@example.com', '89345678901'),
(2, 'Екатерина', 'Петрова', 'katya.petrova@example.com', '89876543210'),
(3, 'Михаил', 'Смирнов', 'mikhail.smirnov@example.com', '81122233333'),
(4, 'Ольга', 'Козлова', 'olga.kozlova@example.com', '84445556666'),
(5, 'Дмитрий', 'Николаев', 'dmitry.nikolaev@example.com', '87778889999');

insert into managers (acc_id, name, surname, department) values
(1, 'Владислав', 'Иванов', 'Администрирование'),
(7, 'Иван', 'Кузнецов', 'Отдел продаж Питер'),
(8, 'Елена', 'Новикова', 'Отдел продаж Владивосток'),
(9, 'Сергей', 'Морозов', 'Отдел продаж Калининград'),
(10, 'Наталья', 'Павлова', 'Отдел продаж Москва');

insert into requests (tour_id, clnt_id, mngr_id, status, create_time, modify_time, data) values
(1, 2, 3, 'принята', '2031-07-25 13:25:00.0', '2031-07-26 13:25:00.0', '{}'),
(2, 4, 5, 'обрабатывается', '2031-07-25 13:25:00.0', '2031-08-01 13:25:00.0', '{}'),
(3, 1, 2, 'подтверждена', '2031-07-25 13:25:00.0', '2031-07-30 13:25:00.0', '{}'),
(4, 3, 4, 'отклонена', '2031-07-25 13:25:00.0', '2031-07-27 13:25:00.0', '{}'),
(5, 5, 1, 'оплачена', '2031-07-25 13:25:00.0', '2031-07-28 13:25:00.0', '{}'),
(6, 1, 2, 'принята', '2031-07-25 13:25:00.0', '2031-07-26 13:25:00.0', '{}'),
(7, 3, 4, 'обрабатывается', '2031-07-25 13:25:00.0', '2031-08-01 13:25:00.0', '{}'),
(8, 5, 1, 'подтверждена', '2031-07-25 13:25:00.0', '2031-07-30 13:25:00.0', '{}'),
(9, 2, 3, 'отклонена', '2031-07-25 13:25:00.0', '2031-07-27 13:25:00.0', '{}'),
(10, 4, 5, 'оплачена', '2031-07-25 13:25:00.0', '2031-07-28 13:25:00.0', '{}');

insert into tours_sales (tour_id, sale_id) values
(1, 5),
(1, 1),
(1, 2),
(2, 3);

-- insert into accounts(login, password) values ('rootlogin', '$2a$10$FvxAHqaBz24Mhk8FccEVIOQnSgwczsDgZpZ2influ0.9jDC3/vqje');
-- insert into managers(acc_id, name, surname, department) VALUES (1, 'Владислав', 'Иванов', 'Администрирование');
